src/main/resources/data/soap-example/findPeopleByEmailRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:user="http://localhost:8080/users-ws">
    <soapenv:Header/>
    <soapenv:Body>
        <user:findPeopleByEmailRequest>
            <user:value>**</user:value>
        </user:findPeopleByEmailRequest>
    </soapenv:Body>
</soapenv:Envelope>